**FREE

/if defined (JWT_HMAC)
/eof
/endif

/define JWT_HMAC

/include 'jwt.rpginc'

dcl-pr jwt_hmac_encode like(jwt_token_t) ccsid(*utf8) extproc(*dclcase);
  algorithm varchar(100) const;
  data like(jwt_token_t) const ccsid(*utf8);
  signKey like(jwt_signkey_t) const ccsid(*utf8);
end-pr;
